PMo_manipulated/Graphviz/53.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "MSPN sends a\ndismissal to MSPO";
  "MSPN sends a\ndismissal to MSPO" -> "MSPO reviews the\ndismissal";
  "MSPO reviews the\ndismissal" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "MSPO rejects the\ndismissal of the\nMSPN";
  "ExclusiveGateway_1" -> "MSPO confirms the\ndismissal of the\nMSPN";
  "MSPO confirms the\ndismissal of the\nMSPN" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "EndNoneEvent";
  "ExclusiveGateway_1" -> "EndNoneEvent";

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
}
